;==============================================================================
;       Module: SparkUI
; Compile Unit: main.jr
;==============================================================================
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
;==============================================================================
; Strings
;==============================================================================
@$cstr_0 = private constant[5 x i8] c"Font\00", align 1
@$cstr_1 = private constant[4 x i8] c"Pen\00", align 1
@$cstr_2 = private constant[6 x i8] c"Brush\00", align 1
@$cstr_3 = private constant[7 x i8] c"Bitmap\00", align 1
@$cstr_4 = private constant[7 x i8] c"Canvas\00", align 1
@$cstr_5 = private constant[7 x i8] c"Tahoma\00", align 1
@$cstr_6 = private constant[21 x i8] c"Checkbox_Checked.bmp\00", align 1
@$cstr_7 = private constant[23 x i8] c"Checkbox_Unchecked.bmp\00", align 1
@$cstr_8 = private constant[17 x i8] c"Checkbox_Dim.bmp\00", align 1
@$cstr_9 = private constant[24 x i8] c"Radiobutton_Checked.bmp\00", align 1
@$cstr_10 = private constant[26 x i8] c"Radiobutton_Unchecked.bmp\00", align 1
@$cstr_11 = private constant[20 x i8] c"Radiobutton_Dim.bmp\00", align 1
@$cstr_12 = private constant[16 x i8] c"Scroll_Left.bmp\00", align 1
@$cstr_13 = private constant[17 x i8] c"Scroll_Right.bmp\00", align 1
@$cstr_14 = private constant[14 x i8] c"Scroll_Up.bmp\00", align 1

!0 = !DIFile(filename: "main.jr", directory: "C:\\2026\\SparkUI\\SparkUI", checksumkind: CSK_MD5, checksum: "a294a677aed37bc0a23298bc4208dc40")
!1 = !DIFile(filename: "array_pWindow.jrt", directory: "C:\\2026\\SparkUI\\SparkUI\\jrt", checksumkind: CSK_MD5, checksum: "1f126d7fd27af92dfdf716deb361d54c")
!2 = !DIFile(filename: "array_pDelegate.jrt", directory: "C:\\2026\\SparkUI\\SparkUI\\jrt", checksumkind: CSK_MD5, checksum: "02b6bc11f5df5de3e45b008ca098b814")
!3 = !DIFile(filename: "array_pobject.jrt", directory: "C:\\2026\\SparkUI\\SparkUI\\jrt", checksumkind: CSK_MD5, checksum: "ddfb8fcb075c83b850578538e08929a6")
!4 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !0, producer: "clang version 21.1.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !5, nameTableKind: None)
!5 = !{!2849, !2863, !2877, !3037, !3105, !3107, !3109, !3111, !3113, !3115, !3117, !3119, !3121, !3123, !3125, !3127, !3129, !3131, !3133, !3135, !3137, !3139, !3141, !3147, !3156, !3359, !3361, !3564, !3585, !3599, !3614, !3817, !3831, !3878, !3921, !3973, !4002, !4106, !4210, !4413, !4510, !4556, !4575, !4616, !4639, !4663, !4785, !4798}
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !17, !17, !18, !18, !19}
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "Font", size: 192, elements: !10)
!10 = !{!11, !13, !16}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "hFont", baseType: !12, offset: 128, size: 64)
!12 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIBasicType(name: "byte", size: 8, encoding: DW_ATE_signed_char)
!21 = distinct !DISubprogram(name: "Font__new", linkageName: "Font__new", scope: !0, file: !0, line: 0, type: !6, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !22)
!22 = !{}
!23 = !DILocalVariable(name: "size", arg: 1, scope: !21, file: !0, line: 0, type: !17)
!24 = !DILocalVariable(name: "weight", arg: 2, scope: !21, file: !0, line: 0, type: !17)
!25 = !DILocalVariable(name: "italic", arg: 3, scope: !21, file: !0, line: 0, type: !18)
!26 = !DILocalVariable(name: "underline", arg: 4, scope: !21, file: !0, line: 0, type: !18)
!27 = !DILocalVariable(name: "faceName", arg: 5, scope: !21, file: !0, line: 0, type: !19)
!28 = !DISubroutineType(types: !29)
!29 = !{!30, !17, !17, !36}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pen", size: 192, elements: !32)
!32 = !{!33, !34, !35}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "hPen", baseType: !12, offset: 128, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!36 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!37 = distinct !DISubprogram(name: "Pen__new", linkageName: "Pen__new", scope: !0, file: !0, line: 0, type: !28, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !38)
!38 = !{}
!39 = !DILocalVariable(name: "style", arg: 1, scope: !37, file: !0, line: 0, type: !17)
!40 = !DILocalVariable(name: "width", arg: 2, scope: !37, file: !0, line: 0, type: !17)
!41 = !DILocalVariable(name: "color", arg: 3, scope: !37, file: !0, line: 0, type: !36)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !36}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", size: 192, elements: !46)
!46 = !{!47, !48, !49}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "hBrush", baseType: !12, offset: 128, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!50 = distinct !DISubprogram(name: "Brush__new", linkageName: "Brush__new", scope: !0, file: !0, line: 0, type: !42, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !51)
!51 = !{}
!52 = !DILocalVariable(name: "color", arg: 1, scope: !50, file: !0, line: 0, type: !36)
!53 = !DISubroutineType(types: !54)
!54 = !{!55}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bitmap", size: 384, elements: !57)
!57 = !{!58, !59, !60, !61, !62, !63, !64}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "hBitmap", baseType: !12, offset: 128, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "width", baseType: !17, offset: 192, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "height", baseType: !17, offset: 224, size: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "bitsPerPixel", baseType: !17, offset: 256, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "pBits", baseType: !15, offset: 320, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!65 = distinct !DISubprogram(name: "Bitmap__new", linkageName: "Bitmap__new", scope: !0, file: !0, line: 0, type: !53, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !66)
!66 = !{}
!67 = !DISubroutineType(types: !68)
!68 = !{!69, !12}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "Canvas", size: 192, elements: !71)
!71 = !{!72, !73, !74}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "hdc", baseType: !12, offset: 128, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!75 = distinct !DISubprogram(name: "Canvas__new", linkageName: "Canvas__new", scope: !0, file: !0, line: 0, type: !67, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !76)
!76 = !{}
!77 = !DILocalVariable(name: "hdc", arg: 1, scope: !75, file: !0, line: 0, type: !12)
!78 = !DISubroutineType(types: !79)
!79 = !{!80}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "WindowDefaults", size: 96, elements: !82)
!82 = !{!83, !84}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!85 = distinct !DISubprogram(name: "WindowDefaults__new", linkageName: "WindowDefaults__new", scope: !0, file: !0, line: 0, type: !78, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !86)
!86 = !{}
!87 = !DISubroutineType(types: !88)
!88 = !{!89}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "MessageBox", size: 96, elements: !91)
!91 = !{!92, !93}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!94 = distinct !DISubprogram(name: "MessageBox__new", linkageName: "MessageBox__new", scope: !0, file: !0, line: 0, type: !87, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !95)
!95 = !{}
!96 = !DISubroutineType(types: !97)
!97 = !{!98}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "Window", size: 912, elements: !100)
!100 = !{!101, !102, !104, !114, !121, !122, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "hWnd", baseType: !12, offset: 128, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "parent", baseType: !103, offset: 192, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "children", baseType: !105, offset: 256, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "array_pWindow", size: 256, elements: !107)
!107 = !{!108, !110, !111, !112, !113}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "data", baseType: !109, offset: 128, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_size", baseType: !17, offset: 192, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_count", baseType: !17, offset: 224, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "className", baseType: !115, offset: 320, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", size: 192, elements: !117)
!117 = !{!118, !119, !120}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "str", baseType: !19, offset: 128, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "text", baseType: !115, offset: 384, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "clientRect", baseType: !123, offset: 448, size: 128)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "RECT", size: 128, elements: !124)
!124 = !{!125, !126, !127, !128}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "left", baseType: !17, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "top", baseType: !17, offset: 32, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "right", baseType: !17, offset: 64, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", baseType: !17, offset: 96, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "backColor", baseType: !36, offset: 576, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "foreColor", baseType: !36, offset: 608, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "backBrush", baseType: !44, offset: 640, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "x", baseType: !17, offset: 704, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "y", baseType: !17, offset: 736, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "width", baseType: !17, offset: 768, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "height", baseType: !17, offset: 800, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Font", baseType: !8, offset: 832, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "visible", baseType: !18, offset: 896, size: 8)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", baseType: !18, offset: 904, size: 8)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!141 = distinct !DISubprogram(name: "Window__new", linkageName: "Window__new", scope: !0, file: !0, line: 0, type: !96, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !142)
!142 = !{}
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !98, !17, !17, !17, !17}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "Control", size: 912, elements: !147)
!147 = !{!148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "hWnd", baseType: !12, offset: 128, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "parent", baseType: !98, offset: 192, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "children", baseType: !105, offset: 256, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "className", baseType: !115, offset: 320, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "text", baseType: !115, offset: 384, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "clientRect", baseType: !123, offset: 448, size: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "backColor", baseType: !36, offset: 576, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "foreColor", baseType: !36, offset: 608, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "backBrush", baseType: !44, offset: 640, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "x", baseType: !17, offset: 704, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "y", baseType: !17, offset: 736, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "width", baseType: !17, offset: 768, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "height", baseType: !17, offset: 800, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Font", baseType: !8, offset: 832, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "visible", baseType: !18, offset: 896, size: 8)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", baseType: !18, offset: 904, size: 8)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!166 = distinct !DISubprogram(name: "Control__new", linkageName: "Control__new", scope: !0, file: !0, line: 0, type: !143, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !167)
!167 = !{}
!168 = !DILocalVariable(name: "parent", arg: 1, scope: !166, file: !0, line: 0, type: !98)
!169 = !DILocalVariable(name: "x", arg: 2, scope: !166, file: !0, line: 0, type: !17)
!170 = !DILocalVariable(name: "y", arg: 3, scope: !166, file: !0, line: 0, type: !17)
!171 = !DILocalVariable(name: "width", arg: 4, scope: !166, file: !0, line: 0, type: !17)
!172 = !DILocalVariable(name: "height", arg: 5, scope: !166, file: !0, line: 0, type: !17)
!173 = !DISubroutineType(types: !174)
!174 = !{!175, !98, !17, !17, !17, !17}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "Label", size: 912, elements: !177)
!177 = !{!178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "hWnd", baseType: !12, offset: 128, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "parent", baseType: !98, offset: 192, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "children", baseType: !105, offset: 256, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "className", baseType: !115, offset: 320, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "text", baseType: !115, offset: 384, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "clientRect", baseType: !123, offset: 448, size: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "backColor", baseType: !36, offset: 576, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "foreColor", baseType: !36, offset: 608, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "backBrush", baseType: !44, offset: 640, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "x", baseType: !17, offset: 704, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "y", baseType: !17, offset: 736, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "width", baseType: !17, offset: 768, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "height", baseType: !17, offset: 800, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Font", baseType: !8, offset: 832, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "visible", baseType: !18, offset: 896, size: 8)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", baseType: !18, offset: 904, size: 8)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!196 = distinct !DISubprogram(name: "Label__new", linkageName: "Label__new", scope: !0, file: !0, line: 0, type: !173, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !197)
!197 = !{}
!198 = !DILocalVariable(name: "parent", arg: 1, scope: !196, file: !0, line: 0, type: !98)
!199 = !DILocalVariable(name: "x", arg: 2, scope: !196, file: !0, line: 0, type: !17)
!200 = !DILocalVariable(name: "y", arg: 3, scope: !196, file: !0, line: 0, type: !17)
!201 = !DILocalVariable(name: "width", arg: 4, scope: !196, file: !0, line: 0, type: !17)
!202 = !DILocalVariable(name: "height", arg: 5, scope: !196, file: !0, line: 0, type: !17)
!203 = !DISubroutineType(types: !204)
!204 = !{!205, !209, !15}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "Delegate", size: 256, elements: !207)
!207 = !{!208, !214, !216, !217}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "target", baseType: !209, offset: 128, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "object", size: 96, elements: !211)
!211 = !{!212, !213}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "method", baseType: !215, offset: 192, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!218 = distinct !DISubprogram(name: "Delegate__new", linkageName: "Delegate__new", scope: !0, file: !0, line: 0, type: !203, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !219)
!219 = !{}
!220 = !DILocalVariable(name: "target", arg: 1, scope: !218, file: !0, line: 0, type: !209)
!221 = !DILocalVariable(name: "method", arg: 2, scope: !218, file: !0, line: 0, type: !15)
!222 = !DISubroutineType(types: !223)
!223 = !{!224}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "Event", size: 192, elements: !226)
!226 = !{!227, !237, !238}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", baseType: !228, offset: 128, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "array_pDelegate", size: 256, elements: !230)
!230 = !{!231, !233, !234, !235, !236}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "data", baseType: !232, offset: 128, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_size", baseType: !17, offset: 192, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_count", baseType: !17, offset: 224, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!239 = distinct !DISubprogram(name: "Event__new", linkageName: "Event__new", scope: !0, file: !0, line: 0, type: !222, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !240)
!240 = !{}
!241 = !DISubroutineType(types: !242)
!242 = !{!243, !98, !17, !17, !17, !17}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "Button", size: 1024, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "Clicked", baseType: !224, offset: 960, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "hWnd", baseType: !12, offset: 128, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "parent", baseType: !98, offset: 192, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "children", baseType: !105, offset: 256, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "className", baseType: !115, offset: 320, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "text", baseType: !115, offset: 384, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "clientRect", baseType: !123, offset: 448, size: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "backColor", baseType: !36, offset: 576, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "foreColor", baseType: !36, offset: 608, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "backBrush", baseType: !44, offset: 640, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "x", baseType: !17, offset: 704, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "y", baseType: !17, offset: 736, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "width", baseType: !17, offset: 768, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "height", baseType: !17, offset: 800, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Font", baseType: !8, offset: 832, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "visible", baseType: !18, offset: 896, size: 8)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", baseType: !18, offset: 904, size: 8)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!265 = distinct !DISubprogram(name: "Button__new", linkageName: "Button__new", scope: !0, file: !0, line: 0, type: !241, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !266)
!266 = !{}
!267 = !DILocalVariable(name: "parent", arg: 1, scope: !265, file: !0, line: 0, type: !98)
!268 = !DILocalVariable(name: "x", arg: 2, scope: !265, file: !0, line: 0, type: !17)
!269 = !DILocalVariable(name: "y", arg: 3, scope: !265, file: !0, line: 0, type: !17)
!270 = !DILocalVariable(name: "width", arg: 4, scope: !265, file: !0, line: 0, type: !17)
!271 = !DILocalVariable(name: "height", arg: 5, scope: !265, file: !0, line: 0, type: !17)
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !98, !17, !17, !17, !17}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "Checkbox", size: 1032, elements: !276)
!276 = !{!277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "Clicked", baseType: !224, offset: 960, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "checked", baseType: !18, offset: 1024, size: 8)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "hWnd", baseType: !12, offset: 128, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "parent", baseType: !98, offset: 192, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "children", baseType: !105, offset: 256, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "className", baseType: !115, offset: 320, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "text", baseType: !115, offset: 384, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "clientRect", baseType: !123, offset: 448, size: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "backColor", baseType: !36, offset: 576, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "foreColor", baseType: !36, offset: 608, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "backBrush", baseType: !44, offset: 640, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "x", baseType: !17, offset: 704, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "y", baseType: !17, offset: 736, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "width", baseType: !17, offset: 768, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "height", baseType: !17, offset: 800, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Font", baseType: !8, offset: 832, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "visible", baseType: !18, offset: 896, size: 8)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", baseType: !18, offset: 904, size: 8)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!297 = distinct !DISubprogram(name: "Checkbox__new", linkageName: "Checkbox__new", scope: !0, file: !0, line: 0, type: !272, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !298)
!298 = !{}
!299 = !DILocalVariable(name: "parent", arg: 1, scope: !297, file: !0, line: 0, type: !98)
!300 = !DILocalVariable(name: "x", arg: 2, scope: !297, file: !0, line: 0, type: !17)
!301 = !DILocalVariable(name: "y", arg: 3, scope: !297, file: !0, line: 0, type: !17)
!302 = !DILocalVariable(name: "width", arg: 4, scope: !297, file: !0, line: 0, type: !17)
!303 = !DILocalVariable(name: "height", arg: 5, scope: !297, file: !0, line: 0, type: !17)
!304 = !DISubroutineType(types: !305)
!305 = !{!306, !98, !17, !17, !17, !17}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "Radiobutton", size: 1088, elements: !308)
!308 = !{!309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Clicked", baseType: !224, offset: 960, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "checked", baseType: !18, offset: 1024, size: 8)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Group", baseType: !17, offset: 1056, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "hWnd", baseType: !12, offset: 128, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "parent", baseType: !98, offset: 192, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "children", baseType: !105, offset: 256, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "className", baseType: !115, offset: 320, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "text", baseType: !115, offset: 384, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "clientRect", baseType: !123, offset: 448, size: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "backColor", baseType: !36, offset: 576, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "foreColor", baseType: !36, offset: 608, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "backBrush", baseType: !44, offset: 640, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "x", baseType: !17, offset: 704, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "y", baseType: !17, offset: 736, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "width", baseType: !17, offset: 768, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "height", baseType: !17, offset: 800, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Font", baseType: !8, offset: 832, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "visible", baseType: !18, offset: 896, size: 8)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", baseType: !18, offset: 904, size: 8)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!330 = distinct !DISubprogram(name: "Radiobutton__new", linkageName: "Radiobutton__new", scope: !0, file: !0, line: 0, type: !304, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !331)
!331 = !{}
!332 = !DILocalVariable(name: "parent", arg: 1, scope: !330, file: !0, line: 0, type: !98)
!333 = !DILocalVariable(name: "x", arg: 2, scope: !330, file: !0, line: 0, type: !17)
!334 = !DILocalVariable(name: "y", arg: 3, scope: !330, file: !0, line: 0, type: !17)
!335 = !DILocalVariable(name: "width", arg: 4, scope: !330, file: !0, line: 0, type: !17)
!336 = !DILocalVariable(name: "height", arg: 5, scope: !330, file: !0, line: 0, type: !17)
!337 = !DISubroutineType(types: !338)
!338 = !{!339, !98, !17, !17, !17, !17}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scrollbar", size: 1152, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "MaxValue", baseType: !17, offset: 928, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "PageSize", baseType: !17, offset: 960, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "position", baseType: !17, offset: 992, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "scrolling", baseType: !18, offset: 1024, size: 8)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "arrowsVisible", baseType: !18, offset: 1032, size: 8)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Scrolled", baseType: !224, offset: 1088, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "hWnd", baseType: !12, offset: 128, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "parent", baseType: !98, offset: 192, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "children", baseType: !105, offset: 256, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "className", baseType: !115, offset: 320, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "text", baseType: !115, offset: 384, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "clientRect", baseType: !123, offset: 448, size: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "backColor", baseType: !36, offset: 576, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "foreColor", baseType: !36, offset: 608, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "backBrush", baseType: !44, offset: 640, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "x", baseType: !17, offset: 704, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "y", baseType: !17, offset: 736, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "width", baseType: !17, offset: 768, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "height", baseType: !17, offset: 800, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "Font", baseType: !8, offset: 832, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "visible", baseType: !18, offset: 896, size: 8)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", baseType: !18, offset: 904, size: 8)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!366 = distinct !DISubprogram(name: "Scrollbar__new", linkageName: "Scrollbar__new", scope: !0, file: !0, line: 0, type: !337, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !367)
!367 = !{}
!368 = !DILocalVariable(name: "parent", arg: 1, scope: !366, file: !0, line: 0, type: !98)
!369 = !DILocalVariable(name: "x", arg: 2, scope: !366, file: !0, line: 0, type: !17)
!370 = !DILocalVariable(name: "y", arg: 3, scope: !366, file: !0, line: 0, type: !17)
!371 = !DILocalVariable(name: "width", arg: 4, scope: !366, file: !0, line: 0, type: !17)
!372 = !DILocalVariable(name: "height", arg: 5, scope: !366, file: !0, line: 0, type: !17)
!373 = !DISubroutineType(types: !374)
!374 = !{!375, !98, !17, !17, !17, !17}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "VScrollbar", size: 1152, elements: !377)
!377 = !{!378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "MaxValue", baseType: !17, offset: 928, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "PageSize", baseType: !17, offset: 960, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "position", baseType: !17, offset: 992, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "scrolling", baseType: !18, offset: 1024, size: 8)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "arrowsVisible", baseType: !18, offset: 1032, size: 8)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Scrolled", baseType: !224, offset: 1088, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "hWnd", baseType: !12, offset: 128, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "parent", baseType: !98, offset: 192, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "children", baseType: !105, offset: 256, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "className", baseType: !115, offset: 320, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "text", baseType: !115, offset: 384, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "clientRect", baseType: !123, offset: 448, size: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "backColor", baseType: !36, offset: 576, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "foreColor", baseType: !36, offset: 608, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "backBrush", baseType: !44, offset: 640, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "x", baseType: !17, offset: 704, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "y", baseType: !17, offset: 736, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "width", baseType: !17, offset: 768, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "height", baseType: !17, offset: 800, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Font", baseType: !8, offset: 832, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "visible", baseType: !18, offset: 896, size: 8)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", baseType: !18, offset: 904, size: 8)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!402 = distinct !DISubprogram(name: "VScrollbar__new", linkageName: "VScrollbar__new", scope: !0, file: !0, line: 0, type: !373, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !403)
!403 = !{}
!404 = !DILocalVariable(name: "parent", arg: 1, scope: !402, file: !0, line: 0, type: !98)
!405 = !DILocalVariable(name: "x", arg: 2, scope: !402, file: !0, line: 0, type: !17)
!406 = !DILocalVariable(name: "y", arg: 3, scope: !402, file: !0, line: 0, type: !17)
!407 = !DILocalVariable(name: "width", arg: 4, scope: !402, file: !0, line: 0, type: !17)
!408 = !DILocalVariable(name: "height", arg: 5, scope: !402, file: !0, line: 0, type: !17)
!409 = !DISubroutineType(types: !410)
!410 = !{!411, !98, !17, !17, !17, !17}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "HScrollbar", size: 1152, elements: !413)
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "MaxValue", baseType: !17, offset: 928, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "PageSize", baseType: !17, offset: 960, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "position", baseType: !17, offset: 992, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "scrolling", baseType: !18, offset: 1024, size: 8)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "arrowsVisible", baseType: !18, offset: 1032, size: 8)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Scrolled", baseType: !224, offset: 1088, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "hWnd", baseType: !12, offset: 128, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "parent", baseType: !98, offset: 192, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "children", baseType: !105, offset: 256, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "className", baseType: !115, offset: 320, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "text", baseType: !115, offset: 384, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "clientRect", baseType: !123, offset: 448, size: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "backColor", baseType: !36, offset: 576, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "foreColor", baseType: !36, offset: 608, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "backBrush", baseType: !44, offset: 640, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "x", baseType: !17, offset: 704, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "y", baseType: !17, offset: 736, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "width", baseType: !17, offset: 768, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "height", baseType: !17, offset: 800, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "Font", baseType: !8, offset: 832, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "visible", baseType: !18, offset: 896, size: 8)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", baseType: !18, offset: 904, size: 8)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!438 = distinct !DISubprogram(name: "HScrollbar__new", linkageName: "HScrollbar__new", scope: !0, file: !0, line: 0, type: !409, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !439)
!439 = !{}
!440 = !DILocalVariable(name: "parent", arg: 1, scope: !438, file: !0, line: 0, type: !98)
!441 = !DILocalVariable(name: "x", arg: 2, scope: !438, file: !0, line: 0, type: !17)
!442 = !DILocalVariable(name: "y", arg: 3, scope: !438, file: !0, line: 0, type: !17)
!443 = !DILocalVariable(name: "width", arg: 4, scope: !438, file: !0, line: 0, type: !17)
!444 = !DILocalVariable(name: "height", arg: 5, scope: !438, file: !0, line: 0, type: !17)
!445 = !DISubroutineType(types: !446)
!446 = !{!447, !98, !17, !17, !17, !17}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "ListItems", size: 1056, elements: !449)
!449 = !{!450, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "items", baseType: !451, offset: 960, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "array_pobject", size: 256, elements: !453)
!453 = !{!454, !456, !457, !458, !459}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "data", baseType: !455, offset: 128, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_size", baseType: !17, offset: 192, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_count", baseType: !17, offset: 224, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "topIndex", baseType: !17, offset: 1024, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "hWnd", baseType: !12, offset: 128, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "parent", baseType: !98, offset: 192, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "children", baseType: !105, offset: 256, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "className", baseType: !115, offset: 320, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "text", baseType: !115, offset: 384, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "clientRect", baseType: !123, offset: 448, size: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "backColor", baseType: !36, offset: 576, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "foreColor", baseType: !36, offset: 608, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "backBrush", baseType: !44, offset: 640, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "x", baseType: !17, offset: 704, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "y", baseType: !17, offset: 736, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "width", baseType: !17, offset: 768, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "height", baseType: !17, offset: 800, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "Font", baseType: !8, offset: 832, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "visible", baseType: !18, offset: 896, size: 8)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", baseType: !18, offset: 904, size: 8)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!479 = distinct !DISubprogram(name: "ListItems__new", linkageName: "ListItems__new", scope: !0, file: !0, line: 0, type: !445, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !480)
!480 = !{}
!481 = !DILocalVariable(name: "parent", arg: 1, scope: !479, file: !0, line: 0, type: !98)
!482 = !DILocalVariable(name: "x", arg: 2, scope: !479, file: !0, line: 0, type: !17)
!483 = !DILocalVariable(name: "y", arg: 3, scope: !479, file: !0, line: 0, type: !17)
!484 = !DILocalVariable(name: "width", arg: 4, scope: !479, file: !0, line: 0, type: !17)
!485 = !DILocalVariable(name: "height", arg: 5, scope: !479, file: !0, line: 0, type: !17)
!486 = !DISubroutineType(types: !487)
!487 = !{!488, !98, !17, !17, !17, !17}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "Listbox", size: 1280, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "vscroll", baseType: !375, offset: 960, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Items", baseType: !447, offset: 1024, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "selectedIndex", baseType: !17, offset: 1088, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "SelectedIndexChanged", baseType: !224, offset: 1152, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "Clicked", baseType: !224, offset: 1216, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "hWnd", baseType: !12, offset: 128, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "parent", baseType: !98, offset: 192, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "children", baseType: !105, offset: 256, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "className", baseType: !115, offset: 320, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "text", baseType: !115, offset: 384, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "clientRect", baseType: !123, offset: 448, size: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "backColor", baseType: !36, offset: 576, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "foreColor", baseType: !36, offset: 608, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "backBrush", baseType: !44, offset: 640, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "x", baseType: !17, offset: 704, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "y", baseType: !17, offset: 736, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "width", baseType: !17, offset: 768, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "height", baseType: !17, offset: 800, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "Font", baseType: !8, offset: 832, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "visible", baseType: !18, offset: 896, size: 8)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", baseType: !18, offset: 904, size: 8)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!514 = distinct !DISubprogram(name: "Listbox__new", linkageName: "Listbox__new", scope: !0, file: !0, line: 0, type: !486, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !515)
!515 = !{}
!516 = !DILocalVariable(name: "parent", arg: 1, scope: !514, file: !0, line: 0, type: !98)
!517 = !DILocalVariable(name: "x", arg: 2, scope: !514, file: !0, line: 0, type: !17)
!518 = !DILocalVariable(name: "y", arg: 3, scope: !514, file: !0, line: 0, type: !17)
!519 = !DILocalVariable(name: "width", arg: 4, scope: !514, file: !0, line: 0, type: !17)
!520 = !DILocalVariable(name: "height", arg: 5, scope: !514, file: !0, line: 0, type: !17)
!521 = !DISubroutineType(types: !522)
!522 = !{!523, !98, !17, !17, !17, !17}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "PopupWindow", size: 912, elements: !525)
!525 = !{!526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "hWnd", baseType: !12, offset: 128, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "parent", baseType: !98, offset: 192, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "children", baseType: !105, offset: 256, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "className", baseType: !115, offset: 320, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "text", baseType: !115, offset: 384, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "clientRect", baseType: !123, offset: 448, size: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "backColor", baseType: !36, offset: 576, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "foreColor", baseType: !36, offset: 608, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "backBrush", baseType: !44, offset: 640, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "x", baseType: !17, offset: 704, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "y", baseType: !17, offset: 736, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "width", baseType: !17, offset: 768, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "height", baseType: !17, offset: 800, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "Font", baseType: !8, offset: 832, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "visible", baseType: !18, offset: 896, size: 8)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", baseType: !18, offset: 904, size: 8)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!544 = distinct !DISubprogram(name: "PopupWindow__new", linkageName: "PopupWindow__new", scope: !0, file: !0, line: 0, type: !521, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !545)
!545 = !{}
!546 = !DILocalVariable(name: "parent", arg: 1, scope: !544, file: !0, line: 0, type: !98)
!547 = !DILocalVariable(name: "x", arg: 2, scope: !544, file: !0, line: 0, type: !17)
!548 = !DILocalVariable(name: "y", arg: 3, scope: !544, file: !0, line: 0, type: !17)
!549 = !DILocalVariable(name: "width", arg: 4, scope: !544, file: !0, line: 0, type: !17)
!550 = !DILocalVariable(name: "height", arg: 5, scope: !544, file: !0, line: 0, type: !17)
!551 = !DISubroutineType(types: !552)
!552 = !{!553, !98, !17, !17, !17, !17}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dropdown", size: 1216, elements: !555)
!555 = !{!556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "popup", baseType: !523, offset: 960, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "listbox", baseType: !488, offset: 1024, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "Items", baseType: !447, offset: 1088, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Clicked", baseType: !224, offset: 1152, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "hWnd", baseType: !12, offset: 128, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "parent", baseType: !98, offset: 192, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "children", baseType: !105, offset: 256, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "className", baseType: !115, offset: 320, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "text", baseType: !115, offset: 384, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "clientRect", baseType: !123, offset: 448, size: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "backColor", baseType: !36, offset: 576, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "foreColor", baseType: !36, offset: 608, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "backBrush", baseType: !44, offset: 640, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "x", baseType: !17, offset: 704, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "y", baseType: !17, offset: 736, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "width", baseType: !17, offset: 768, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "height", baseType: !17, offset: 800, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Font", baseType: !8, offset: 832, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "visible", baseType: !18, offset: 896, size: 8)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", baseType: !18, offset: 904, size: 8)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!578 = distinct !DISubprogram(name: "Dropdown__new", linkageName: "Dropdown__new", scope: !0, file: !0, line: 0, type: !551, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !579)
!579 = !{}
!580 = !DILocalVariable(name: "parent", arg: 1, scope: !578, file: !0, line: 0, type: !98)
!581 = !DILocalVariable(name: "x", arg: 2, scope: !578, file: !0, line: 0, type: !17)
!582 = !DILocalVariable(name: "y", arg: 3, scope: !578, file: !0, line: 0, type: !17)
!583 = !DILocalVariable(name: "width", arg: 4, scope: !578, file: !0, line: 0, type: !17)
!584 = !DILocalVariable(name: "height", arg: 5, scope: !578, file: !0, line: 0, type: !17)
!585 = !DISubroutineType(types: !586)
!586 = !{!587, !98, !17, !17, !17, !17}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "Panel", size: 1024, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "border", baseType: !18, offset: 912, size: 8)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "forePen", baseType: !30, offset: 960, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "hWnd", baseType: !12, offset: 128, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "parent", baseType: !98, offset: 192, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "children", baseType: !105, offset: 256, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "className", baseType: !115, offset: 320, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "text", baseType: !115, offset: 384, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "clientRect", baseType: !123, offset: 448, size: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "backColor", baseType: !36, offset: 576, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "foreColor", baseType: !36, offset: 608, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "backBrush", baseType: !44, offset: 640, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "x", baseType: !17, offset: 704, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "y", baseType: !17, offset: 736, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "width", baseType: !17, offset: 768, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "height", baseType: !17, offset: 800, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Font", baseType: !8, offset: 832, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "visible", baseType: !18, offset: 896, size: 8)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", baseType: !18, offset: 904, size: 8)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!610 = distinct !DISubprogram(name: "Panel__new", linkageName: "Panel__new", scope: !0, file: !0, line: 0, type: !585, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !611)
!611 = !{}
!612 = !DILocalVariable(name: "parent", arg: 1, scope: !610, file: !0, line: 0, type: !98)
!613 = !DILocalVariable(name: "x", arg: 2, scope: !610, file: !0, line: 0, type: !17)
!614 = !DILocalVariable(name: "y", arg: 3, scope: !610, file: !0, line: 0, type: !17)
!615 = !DILocalVariable(name: "w", arg: 4, scope: !610, file: !0, line: 0, type: !17)
!616 = !DILocalVariable(name: "h", arg: 5, scope: !610, file: !0, line: 0, type: !17)
!617 = !DISubroutineType(types: !618)
!618 = !{!619, !98, !17, !17, !17, !17}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "Picturebox", size: 1088, elements: !621)
!621 = !{!622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", baseType: !55, offset: 1024, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "border", baseType: !18, offset: 912, size: 8)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "forePen", baseType: !30, offset: 960, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "hWnd", baseType: !12, offset: 128, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "parent", baseType: !98, offset: 192, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "children", baseType: !105, offset: 256, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "className", baseType: !115, offset: 320, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "text", baseType: !115, offset: 384, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "clientRect", baseType: !123, offset: 448, size: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "backColor", baseType: !36, offset: 576, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "foreColor", baseType: !36, offset: 608, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "backBrush", baseType: !44, offset: 640, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "x", baseType: !17, offset: 704, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "y", baseType: !17, offset: 736, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "width", baseType: !17, offset: 768, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "height", baseType: !17, offset: 800, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Font", baseType: !8, offset: 832, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "visible", baseType: !18, offset: 896, size: 8)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", baseType: !18, offset: 904, size: 8)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!643 = distinct !DISubprogram(name: "Picturebox__new", linkageName: "Picturebox__new", scope: !0, file: !0, line: 0, type: !617, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !644)
!644 = !{}
!645 = !DILocalVariable(name: "parent", arg: 1, scope: !643, file: !0, line: 0, type: !98)
!646 = !DILocalVariable(name: "x", arg: 2, scope: !643, file: !0, line: 0, type: !17)
!647 = !DILocalVariable(name: "y", arg: 3, scope: !643, file: !0, line: 0, type: !17)
!648 = !DILocalVariable(name: "width", arg: 4, scope: !643, file: !0, line: 0, type: !17)
!649 = !DILocalVariable(name: "height", arg: 5, scope: !643, file: !0, line: 0, type: !17)
!650 = !DISubroutineType(types: !651)
!651 = !{!652}
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "MyWindow", size: 2432, elements: !654)
!654 = !{!655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "bkgBrush", baseType: !44, offset: 960, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "font", baseType: !8, offset: 1024, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pen", baseType: !30, offset: 1088, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "brush", baseType: !44, offset: 1152, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "testBitmap2", baseType: !55, offset: 1216, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "label1", baseType: !175, offset: 1280, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "button1", baseType: !243, offset: 1344, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "button2", baseType: !243, offset: 1408, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "button3", baseType: !243, offset: 1472, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "checkbox1", baseType: !274, offset: 1536, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "checkbox2", baseType: !274, offset: 1600, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "radio1", baseType: !306, offset: 1664, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "radio2", baseType: !306, offset: 1728, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "vscroll", baseType: !375, offset: 1792, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "hscroll", baseType: !411, offset: 1856, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "listbox", baseType: !488, offset: 1920, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "button4", baseType: !243, offset: 1984, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "button5", baseType: !243, offset: 2048, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "button6", baseType: !243, offset: 2112, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "button7", baseType: !243, offset: 2176, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "dropdown", baseType: !553, offset: 2240, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "panel", baseType: !587, offset: 2304, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "picturebox", baseType: !619, offset: 2368, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "hWnd", baseType: !12, offset: 128, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "parent", baseType: !98, offset: 192, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "children", baseType: !105, offset: 256, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "className", baseType: !115, offset: 320, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "text", baseType: !115, offset: 384, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "clientRect", baseType: !123, offset: 448, size: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "backColor", baseType: !36, offset: 576, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "foreColor", baseType: !36, offset: 608, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "backBrush", baseType: !44, offset: 640, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "x", baseType: !17, offset: 704, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "y", baseType: !17, offset: 736, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "width", baseType: !17, offset: 768, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "height", baseType: !17, offset: 800, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Font", baseType: !8, offset: 832, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "visible", baseType: !18, offset: 896, size: 8)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", baseType: !18, offset: 904, size: 8)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!696 = distinct !DISubprogram(name: "MyWindow__new", linkageName: "MyWindow__new", scope: !0, file: !0, line: 0, type: !650, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !697)
!697 = !{}
!698 = !DISubroutineType(types: !699)
!699 = !{!17, !17, !17, !17}
!700 = distinct !DISubprogram(name: "MulDiv", linkageName: "MulDiv", scope: !0, file: !0, line: 271, type: !698, scopeLine: 272, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !701)
!701 = !{}
!702 = !DILocalVariable(name: "x", arg: 1, scope: !700, file: !0, line: 271, type: !17)
!703 = !DILocalVariable(name: "y", arg: 2, scope: !700, file: !0, line: 271, type: !17)
!704 = !DILocalVariable(name: "z", arg: 3, scope: !700, file: !0, line: 271, type: !17)
!705 = !DISubroutineType(types: !706)
!706 = !{!8, !8, !17, !17, !18, !18, !19}
!707 = distinct !DISubprogram(name: "constructor", linkageName: "Font__constructor", scope: !9, file: !0, line: 283, type: !705, scopeLine: 283, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !708)
!708 = !{}
!709 = !DILocalVariable(name: "this", arg: 1, scope: !707, file: !0, line: 282, type: !8)
!710 = !DILocalVariable(name: "size", arg: 2, scope: !707, file: !0, line: 282, type: !17)
!711 = !DILocalVariable(name: "weight", arg: 3, scope: !707, file: !0, line: 282, type: !17)
!712 = !DILocalVariable(name: "italic", arg: 4, scope: !707, file: !0, line: 282, type: !18)
!713 = !DILocalVariable(name: "underline", arg: 5, scope: !707, file: !0, line: 282, type: !18)
!714 = !DILocalVariable(name: "faceName", arg: 6, scope: !707, file: !0, line: 282, type: !19)
!715 = !DILocalVariable(name: "__temp285", scope: !707, file: !0, line: 0, type: !209)
!716 = !DILocalVariable(name: "gdc", scope: !707, file: !0, line: 285, type: !12)
!717 = !DILocalVariable(name: "height", scope: !707, file: !0, line: 286, type: !17)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !8}
!720 = distinct !DISubprogram(name: "destructor", linkageName: "Font__destructor", scope: !9, file: !0, line: 293, type: !718, scopeLine: 293, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !721)
!721 = !{}
!722 = !DILocalVariable(name: "this", arg: 1, scope: !720, file: !0, line: 292, type: !8)
!723 = !DISubroutineType(types: !724)
!724 = !{!19, !8}
!725 = distinct !DISubprogram(name: "Font__getClassName", linkageName: "Font__getClassName", scope: !0, file: !0, line: 0, type: !723, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !726)
!726 = !{}
!727 = !DILocalVariable(name: "this", arg: 1, scope: !725, file: !0, line: 0, type: !8)
!728 = !DISubroutineType(types: !729)
!729 = !{!8, !8}
!730 = distinct !DISubprogram(name: "Font__finalize", linkageName: "Font__finalize", scope: !0, file: !0, line: 0, type: !728, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !731)
!731 = !{}
!732 = !DILocalVariable(name: "this", arg: 1, scope: !730, file: !0, line: 0, type: !8)
!733 = !DISubroutineType(types: !734)
!734 = !{!8, !8}
!735 = distinct !DISubprogram(name: "Font__init", linkageName: "Font__init", scope: !0, file: !0, line: 0, type: !733, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !736)
!736 = !{}
!737 = !DILocalVariable(name: "this", arg: 1, scope: !735, file: !0, line: 0, type: !8)
!738 = !DISubroutineType(types: !739)
!739 = !{!30, !30, !17, !17, !36}
!740 = distinct !DISubprogram(name: "constructor", linkageName: "Pen__constructor", scope: !31, file: !0, line: 303, type: !738, scopeLine: 303, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !741)
!741 = !{}
!742 = !DILocalVariable(name: "this", arg: 1, scope: !740, file: !0, line: 302, type: !30)
!743 = !DILocalVariable(name: "style", arg: 2, scope: !740, file: !0, line: 302, type: !17)
!744 = !DILocalVariable(name: "width", arg: 3, scope: !740, file: !0, line: 302, type: !17)
!745 = !DILocalVariable(name: "color", arg: 4, scope: !740, file: !0, line: 302, type: !36)
!746 = !DILocalVariable(name: "__temp305", scope: !740, file: !0, line: 0, type: !209)
!747 = !DISubroutineType(types: !748)
!748 = !{null, !30}
!749 = distinct !DISubprogram(name: "destructor", linkageName: "Pen__destructor", scope: !31, file: !0, line: 310, type: !747, scopeLine: 310, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !750)
!750 = !{}
!751 = !DILocalVariable(name: "this", arg: 1, scope: !749, file: !0, line: 309, type: !30)
!752 = !DISubroutineType(types: !753)
!753 = !{!19, !30}
!754 = distinct !DISubprogram(name: "Pen__getClassName", linkageName: "Pen__getClassName", scope: !0, file: !0, line: 0, type: !752, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !755)
!755 = !{}
!756 = !DILocalVariable(name: "this", arg: 1, scope: !754, file: !0, line: 0, type: !30)
!757 = !DISubroutineType(types: !758)
!758 = !{!30, !30}
!759 = distinct !DISubprogram(name: "Pen__finalize", linkageName: "Pen__finalize", scope: !0, file: !0, line: 0, type: !757, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !760)
!760 = !{}
!761 = !DILocalVariable(name: "this", arg: 1, scope: !759, file: !0, line: 0, type: !30)
!762 = !DISubroutineType(types: !763)
!763 = !{!30, !30}
!764 = distinct !DISubprogram(name: "Pen__init", linkageName: "Pen__init", scope: !0, file: !0, line: 0, type: !762, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !765)
!765 = !{}
!766 = !DILocalVariable(name: "this", arg: 1, scope: !764, file: !0, line: 0, type: !30)
!767 = !DISubroutineType(types: !768)
!768 = !{!44, !44, !36}
!769 = distinct !DISubprogram(name: "constructor", linkageName: "Brush__constructor", scope: !45, file: !0, line: 320, type: !767, scopeLine: 320, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !770)
!770 = !{}
!771 = !DILocalVariable(name: "this", arg: 1, scope: !769, file: !0, line: 319, type: !44)
!772 = !DILocalVariable(name: "color", arg: 2, scope: !769, file: !0, line: 319, type: !36)
!773 = !DILocalVariable(name: "__temp322", scope: !769, file: !0, line: 0, type: !209)
!774 = !DISubroutineType(types: !775)
!775 = !{null, !44}
!776 = distinct !DISubprogram(name: "destructor", linkageName: "Brush__destructor", scope: !45, file: !0, line: 327, type: !774, scopeLine: 327, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !777)
!777 = !{}
!778 = !DILocalVariable(name: "this", arg: 1, scope: !776, file: !0, line: 326, type: !44)
!779 = !DISubroutineType(types: !780)
!780 = !{!19, !44}
!781 = distinct !DISubprogram(name: "Brush__getClassName", linkageName: "Brush__getClassName", scope: !0, file: !0, line: 0, type: !779, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !782)
!782 = !{}
!783 = !DILocalVariable(name: "this", arg: 1, scope: !781, file: !0, line: 0, type: !44)
!784 = !DISubroutineType(types: !785)
!785 = !{!44, !44}
!786 = distinct !DISubprogram(name: "Brush__finalize", linkageName: "Brush__finalize", scope: !0, file: !0, line: 0, type: !784, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !787)
!787 = !{}
!788 = !DILocalVariable(name: "this", arg: 1, scope: !786, file: !0, line: 0, type: !44)
!789 = !DISubroutineType(types: !790)
!790 = !{!44, !44}
!791 = distinct !DISubprogram(name: "Brush__init", linkageName: "Brush__init", scope: !0, file: !0, line: 0, type: !789, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !792)
!792 = !{}
!793 = !DILocalVariable(name: "this", arg: 1, scope: !791, file: !0, line: 0, type: !44)
!794 = !DISubroutineType(types: !795)
!795 = !{!55, !55}
!796 = distinct !DISubprogram(name: "constructor", linkageName: "Bitmap__constructor", scope: !56, file: !0, line: 341, type: !794, scopeLine: 341, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !797)
!797 = !{}
!798 = !DILocalVariable(name: "this", arg: 1, scope: !796, file: !0, line: 340, type: !55)
!799 = !DILocalVariable(name: "__temp343", scope: !796, file: !0, line: 0, type: !209)
!800 = !DISubroutineType(types: !801)
!801 = !{null, !55}
!802 = distinct !DISubprogram(name: "destructor", linkageName: "Bitmap__destructor", scope: !56, file: !0, line: 347, type: !800, scopeLine: 347, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !803)
!803 = !{}
!804 = !DILocalVariable(name: "this", arg: 1, scope: !802, file: !0, line: 346, type: !55)
!805 = !DISubroutineType(types: !806)
!806 = !{!55, !17, !17, !17}
!807 = distinct !DISubprogram(name: "FromSize", linkageName: "Bitmap__FromSize", scope: !56, file: !0, line: 356, type: !805, scopeLine: 356, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !808)
!808 = !{}
!809 = !DILocalVariable(name: "width", arg: 1, scope: !807, file: !0, line: 355, type: !17)
!810 = !DILocalVariable(name: "height", arg: 2, scope: !807, file: !0, line: 355, type: !17)
!811 = !DILocalVariable(name: "bitsPerPixel", arg: 3, scope: !807, file: !0, line: 355, type: !17)
!812 = !DILocalVariable(name: "bitmap", scope: !807, file: !0, line: 363, type: !55)
!813 = !DILocalVariable(name: "bmi", scope: !807, file: !0, line: 368, type: !814)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "BITMAPINFO", size: 416, elements: !815)
!815 = !{!816, !831}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "bmiHeader", baseType: !817, size: 320)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "BITMAPINFOHEADER", size: 320, elements: !818)
!818 = !{!819, !820, !821, !822, !824, !825, !826, !827, !828, !829, !830}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "biSize", baseType: !36, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "biWidth", baseType: !17, offset: 32, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "biHeight", baseType: !17, offset: 64, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "biPlanes", baseType: !823, offset: 96, size: 16)
!823 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "biBitCount", baseType: !823, offset: 112, size: 16)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "biCompression", baseType: !36, offset: 128, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "biSizeImage", baseType: !36, offset: 160, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "biXPelsPerMeter", baseType: !17, offset: 192, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "biYPelsPerMeter", baseType: !17, offset: 224, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "biClrUsed", baseType: !36, offset: 256, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "biClrImportant", baseType: !36, offset: 288, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "bmiColors", baseType: !832, offset: 320, size: 96)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 96, elements: !833)
!833 = !{!834}
!834 = !DISubrange(count: 3)
!835 = !DILocalVariable(name: "hdc", scope: !807, file: !0, line: 388, type: !12)
!836 = !DISubroutineType(types: !837)
!837 = !{!55, !115}
!838 = distinct !DISubprogram(name: "FromFile", linkageName: "Bitmap__FromFile", scope: !56, file: !0, line: 403, type: !836, scopeLine: 403, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !839)
!839 = !{}
!840 = !DILocalVariable(name: "filename", arg: 1, scope: !838, file: !0, line: 402, type: !115)
!841 = !DILocalVariable(name: "f", scope: !838, file: !0, line: 405, type: !842)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", size: 192, elements: !844)
!844 = !{!845, !846, !847}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "fptr", baseType: !15, offset: 128, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", baseType: !14, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", baseType: !17, offset: 64, size: 32)
!848 = !DILocalVariable(name: "bfType", scope: !838, file: !0, line: 413, type: !823)
!849 = !DILocalVariable(name: "bfSize", scope: !838, file: !0, line: 414, type: !36)
!850 = !DILocalVariable(name: "bfReserved1", scope: !838, file: !0, line: 415, type: !823)
!851 = !DILocalVariable(name: "bfReserved2", scope: !838, file: !0, line: 416, type: !823)
!852 = !DILocalVariable(name: "bfOffBits", scope: !838, file: !0, line: 417, type: !36)
!853 = !DILocalVariable(name: "infoHeader", scope: !838, file: !0, line: 432, type: !817)
!854 = !DILocalVariable(name: "bitmap", scope: !838, file: !0, line: 448, type: !55)
!855 = !DILocalVariable(name: "bmi", scope: !838, file: !0, line: 453, type: !814)
!856 = !DILocalVariable(name: "hdc", scope: !838, file: !0, line: 471, type: !12)
!857 = !DILocalVariable(name: "rowSize", scope: !838, file: !0, line: 482, type: !17)
!858 = !DILocalVariable(name: "imageSize", scope: !838, file: !0, line: 483, type: !17)
!859 = !DILocalVariable(name: "tempBuffer", scope: !838, file: !0, line: 485, type: !19)
!860 = !DILocalVariable(name: "skipBytes", scope: !838, file: !0, line: 488, type: !36)
!861 = !DILocalVariable(name: "dest", scope: !838, file: !0, line: 506, type: !19)
!862 = !DILocalVariable(name: "destRowSize", scope: !838, file: !0, line: 507, type: !17)
!863 = !DILocalVariable(name: "y", scope: !838, file: !0, line: 0, type: !17)
!864 = !DILocalVariable(name: "srcRow", scope: !838, file: !0, line: 513, type: !19)
!865 = !DILocalVariable(name: "destRow", scope: !838, file: !0, line: 514, type: !19)
!866 = !DILocalVariable(name: "x", scope: !838, file: !0, line: 0, type: !17)
!867 = !DILocalVariable(name: "y", scope: !838, file: !0, line: 0, type: !17)
!868 = !DILocalVariable(name: "srcRow", scope: !838, file: !0, line: 523, type: !19)
!869 = !DILocalVariable(name: "destRow", scope: !838, file: !0, line: 524, type: !19)
!870 = !DILocalVariable(name: "x", scope: !838, file: !0, line: 0, type: !17)
!871 = !DILocalVariable(name: "i", scope: !838, file: !0, line: 0, type: !17)
!872 = !DILocalVariable(name: "pixel", scope: !838, file: !0, line: 535, type: !873)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DIBasicType(name: "ubyte", size: 8, encoding: DW_ATE_unsigned_char)
!875 = !DILocalVariable(name: "r", scope: !838, file: !0, line: 536, type: !36)
!876 = !DILocalVariable(name: "g", scope: !838, file: !0, line: 537, type: !36)
!877 = !DILocalVariable(name: "b", scope: !838, file: !0, line: 538, type: !36)
!878 = !DILocalVariable(name: "a", scope: !838, file: !0, line: 539, type: !36)
!879 = !DISubroutineType(types: !880)
!880 = !{!15, !55}
!881 = distinct !DISubprogram(name: "get_PixelData", linkageName: "Bitmap__get_PixelData", scope: !56, file: !0, line: 555, type: !879, scopeLine: 555, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !882)
!882 = !{}
!883 = !DILocalVariable(name: "this", arg: 1, scope: !881, file: !0, line: 554, type: !55)
!884 = !DISubroutineType(types: !885)
!885 = !{!17, !55}
!886 = distinct !DISubprogram(name: "get_Width", linkageName: "Bitmap__get_Width", scope: !56, file: !0, line: 560, type: !884, scopeLine: 560, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !887)
!887 = !{}
!888 = !DILocalVariable(name: "this", arg: 1, scope: !886, file: !0, line: 559, type: !55)
!889 = !DISubroutineType(types: !890)
!890 = !{!17, !55}
!891 = distinct !DISubprogram(name: "get_Height", linkageName: "Bitmap__get_Height", scope: !56, file: !0, line: 565, type: !889, scopeLine: 565, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !892)
!892 = !{}
!893 = !DILocalVariable(name: "this", arg: 1, scope: !891, file: !0, line: 564, type: !55)
!894 = !DISubroutineType(types: !895)
!895 = !{!17, !55}
!896 = distinct !DISubprogram(name: "get_BitsPerPixel", linkageName: "Bitmap__get_BitsPerPixel", scope: !56, file: !0, line: 570, type: !894, scopeLine: 570, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !897)
!897 = !{}
!898 = !DILocalVariable(name: "this", arg: 1, scope: !896, file: !0, line: 569, type: !55)
!899 = !DISubroutineType(types: !900)
!900 = !{!19, !55}
!901 = distinct !DISubprogram(name: "Bitmap__getClassName", linkageName: "Bitmap__getClassName", scope: !0, file: !0, line: 0, type: !899, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !902)
!902 = !{}
!903 = !DILocalVariable(name: "this", arg: 1, scope: !901, file: !0, line: 0, type: !55)
!904 = !DISubroutineType(types: !905)
!905 = !{!55, !55}
!906 = distinct !DISubprogram(name: "Bitmap__finalize", linkageName: "Bitmap__finalize", scope: !0, file: !0, line: 0, type: !904, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !907)
!907 = !{}
!908 = !DILocalVariable(name: "this", arg: 1, scope: !906, file: !0, line: 0, type: !55)
!909 = !DISubroutineType(types: !910)
!910 = !{!55, !55}
!911 = distinct !DISubprogram(name: "Bitmap__init", linkageName: "Bitmap__init", scope: !0, file: !0, line: 0, type: !909, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !912)
!912 = !{}
!913 = !DILocalVariable(name: "this", arg: 1, scope: !911, file: !0, line: 0, type: !55)
!914 = !DISubroutineType(types: !915)
!915 = !{!69, !69, !12}
!916 = distinct !DISubprogram(name: "constructor", linkageName: "Canvas__constructor", scope: !70, file: !0, line: 580, type: !914, scopeLine: 580, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !917)
!917 = !{}
!918 = !DILocalVariable(name: "this", arg: 1, scope: !916, file: !0, line: 579, type: !69)
!919 = !DILocalVariable(name: "hdc", arg: 2, scope: !916, file: !0, line: 579, type: !12)
!920 = !DILocalVariable(name: "__temp582", scope: !916, file: !0, line: 0, type: !209)
!921 = !DISubroutineType(types: !922)
!922 = !{null, !69, !17, !17, !17, !17, !30}
!923 = distinct !DISubprogram(name: "DrawLine", linkageName: "Canvas__DrawLine", scope: !70, file: !0, line: 587, type: !921, scopeLine: 587, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !924)
!924 = !{}
!925 = !DILocalVariable(name: "this", arg: 1, scope: !923, file: !0, line: 586, type: !69)
!926 = !DILocalVariable(name: "x1", arg: 2, scope: !923, file: !0, line: 586, type: !17)
!927 = !DILocalVariable(name: "y1", arg: 3, scope: !923, file: !0, line: 586, type: !17)
!928 = !DILocalVariable(name: "x2", arg: 4, scope: !923, file: !0, line: 586, type: !17)
!929 = !DILocalVariable(name: "y2", arg: 5, scope: !923, file: !0, line: 586, type: !17)
!930 = !DILocalVariable(name: "pen", arg: 6, scope: !923, file: !0, line: 586, type: !30)
!931 = !DILocalVariable(name: "hPrevPen", scope: !923, file: !0, line: 588, type: !12)
!932 = !DISubroutineType(types: !933)
!933 = !{null, !69, !17, !17, !17, !17, !30}
!934 = distinct !DISubprogram(name: "DrawRectangle", linkageName: "Canvas__DrawRectangle", scope: !70, file: !0, line: 595, type: !932, scopeLine: 595, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !935)
!935 = !{}
!936 = !DILocalVariable(name: "this", arg: 1, scope: !934, file: !0, line: 594, type: !69)
!937 = !DILocalVariable(name: "left", arg: 2, scope: !934, file: !0, line: 594, type: !17)
!938 = !DILocalVariable(name: "top", arg: 3, scope: !934, file: !0, line: 594, type: !17)
!939 = !DILocalVariable(name: "width", arg: 4, scope: !934, file: !0, line: 594, type: !17)
!940 = !DILocalVariable(name: "height", arg: 5, scope: !934, file: !0, line: 594, type: !17)
!941 = !DILocalVariable(name: "pen", arg: 6, scope: !934, file: !0, line: 594, type: !30)
!942 = !DILocalVariable(name: "hPrevPen", scope: !934, file: !0, line: 596, type: !12)
!943 = !DILocalVariable(name: "hPrevBrush", scope: !934, file: !0, line: 597, type: !12)
!944 = !DISubroutineType(types: !945)
!945 = !{null, !69, !17, !17, !17, !17, !44}
!946 = distinct !DISubprogram(name: "FillRectangle", linkageName: "Canvas__FillRectangle", scope: !70, file: !0, line: 604, type: !944, scopeLine: 604, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !947)
!947 = !{}
!948 = !DILocalVariable(name: "this", arg: 1, scope: !946, file: !0, line: 603, type: !69)
!949 = !DILocalVariable(name: "left", arg: 2, scope: !946, file: !0, line: 603, type: !17)
!950 = !DILocalVariable(name: "top", arg: 3, scope: !946, file: !0, line: 603, type: !17)
!951 = !DILocalVariable(name: "width", arg: 4, scope: !946, file: !0, line: 603, type: !17)
!952 = !DILocalVariable(name: "height", arg: 5, scope: !946, file: !0, line: 603, type: !17)
!953 = !DILocalVariable(name: "brush", arg: 6, scope: !946, file: !0, line: 603, type: !44)
!954 = !DILocalVariable(name: "hPrevBrush", scope: !946, file: !0, line: 605, type: !12)
!955 = !DILocalVariable(name: "hPrevPen", scope: !946, file: !0, line: 606, type: !12)
!956 = !DISubroutineType(types: !957)
!957 = !{null, !69, !17, !17, !115, !8, !36}
!958 = distinct !DISubprogram(name: "DrawText", linkageName: "Canvas__DrawText", scope: !70, file: !0, line: 613, type: !956, scopeLine: 613, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !959)
!959 = !{}
!960 = !DILocalVariable(name: "this", arg: 1, scope: !958, file: !0, line: 612, type: !69)
!961 = !DILocalVariable(name: "x", arg: 2, scope: !958, file: !0, line: 612, type: !17)
!962 = !DILocalVariable(name: "y", arg: 3, scope: !958, file: !0, line: 612, type: !17)
!963 = !DILocalVariable(name: "text", arg: 4, scope: !958, file: !0, line: 612, type: !115)
!964 = !DILocalVariable(name: "font", arg: 5, scope: !958, file: !0, line: 612, type: !8)
!965 = !DILocalVariable(name: "color", arg: 6, scope: !958, file: !0, line: 612, type: !36)
!966 = !DILocalVariable(name: "hPrevFont", scope: !958, file: !0, line: 614, type: !12)
!967 = !DISubroutineType(types: !968)
!968 = !{!969, !69, !115, !8}
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "SIZE", size: 64, elements: !970)
!970 = !{!971, !972}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "cx", baseType: !17, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "cy", baseType: !17, offset: 32, size: 32)
!973 = distinct !DISubprogram(name: "MeasureText", linkageName: "Canvas__MeasureText", scope: !70, file: !0, line: 622, type: !967, scopeLine: 622, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !974)
!974 = !{}
!975 = !DILocalVariable(name: "this", arg: 1, scope: !973, file: !0, line: 621, type: !69)
!976 = !DILocalVariable(name: "text", arg: 2, scope: !973, file: !0, line: 621, type: !115)
!977 = !DILocalVariable(name: "font", arg: 3, scope: !973, file: !0, line: 621, type: !8)
!978 = !DILocalVariable(name: "hPrevFont", scope: !973, file: !0, line: 623, type: !12)
!979 = !DILocalVariable(name: "size", scope: !973, file: !0, line: 624, type: !969)
!980 = !DISubroutineType(types: !981)
!981 = !{null, !69, !17, !17, !17, !17, !55}
!982 = distinct !DISubprogram(name: "DrawBitmap", linkageName: "Canvas__DrawBitmap", scope: !70, file: !0, line: 631, type: !980, scopeLine: 631, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !983)
!983 = !{}
!984 = !DILocalVariable(name: "this", arg: 1, scope: !982, file: !0, line: 630, type: !69)
!985 = !DILocalVariable(name: "x", arg: 2, scope: !982, file: !0, line: 630, type: !17)
!986 = !DILocalVariable(name: "y", arg: 3, scope: !982, file: !0, line: 630, type: !17)
!987 = !DILocalVariable(name: "width", arg: 4, scope: !982, file: !0, line: 630, type: !17)
!988 = !DILocalVariable(name: "height", arg: 5, scope: !982, file: !0, line: 630, type: !17)
!989 = !DILocalVariable(name: "bitmap", arg: 6, scope: !982, file: !0, line: 630, type: !55)
!990 = !DILocalVariable(name: "memDC", scope: !982, file: !0, line: 635, type: !12)
!991 = !DILocalVariable(name: "hOldBitmap", scope: !982, file: !0, line: 636, type: !12)
!992 = !DILocalVariable(name: "blend", scope: !982, file: !0, line: 641, type: !993)
!993 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLENDFUNCTION", size: 32, elements: !994)
!994 = !{!995, !996, !997, !998}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "BlendOp", baseType: !20, size: 8)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "BlendFlags", baseType: !20, offset: 8, size: 8)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "SourceConstantAlpha", baseType: !20, offset: 16, size: 8)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "AlphaFormat", baseType: !20, offset: 24, size: 8)
!999 = !DILocalVariable(name: "blendLong", scope: !982, file: !0, line: 647, type: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!19, !69}
!1003 = distinct !DISubprogram(name: "Canvas__getClassName", linkageName: "Canvas__getClassName", scope: !0, file: !0, line: 0, type: !1001, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !1004)
!1004 = !{}
!1005 = !DILocalVariable(name: "this", arg: 1, scope: !1003, file: !0, line: 0, type: !69)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!69, !69}
!1008 = distinct !DISubprogram(name: "Canvas__finalize", linkageName: "Canvas__finalize", scope: !0, file: !0, line: 0, type: !1006, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !1009)
!1009 = !{}
!1010 = !DILocalVariable(name: "this", arg: 1, scope: !1008, file: !0, line: 0, type: !69)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!69, !69}
!1013 = distinct !DISubprogram(name: "Canvas__init", linkageName: "Canvas__init", scope: !0, file: !0, line: 0, type: !1011, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !1014)
!1014 = !{}
!1015 = !DILocalVariable(name: "this", arg: 1, scope: !1013, file: !0, line: 0, type: !69)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!80, !80}
!1018 = distinct !DISubprogram(name: "WindowDefaults__constructor", linkageName: "WindowDefaults__constructor", scope: !0, file: !0, line: 0, type: !1016, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !1019)
!1019 = !{}
!1020 = !DILocalVariable(name: "this", arg: 1, scope: !1018, file: !0, line: 0, type: !80)
!1021 = !DILocalVariable(name: "__temp697", scope: !1018, file: !0, line: 0, type: !80)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!19, !80}
!1024 = distinct !DISubprogram(name: "WindowDefaults__getClassName", linkageName: "WindowDefaults__getClassName", scope: !0, file: !0, line: 0, type: !1022, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !1025)
!1025 = !{}
!1026 = !DILocalVariable(name: "this", arg: 1, scope: !1024, file: !0, line: 0, type: !80)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!80, !80}
!1029 = distinct !DISubprogram(name: "WindowDefaults__finalize", linkageName: "WindowDefaults__finalize", scope: !0, file: !0, line: 0, type: !1027, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !1030)
!1030 = !{}
!1031 = !DILocalVariable(name: "this", arg: 1, scope: !1029, file: !0, line: 0, type: !80)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!80, !80}
!1034 = distinct !DISubprogram(name: "WindowDefaults__init", linkageName: "WindowDefaults__init", scope: !0, file: !0, line: 0, type: !1032, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !1035)
!1035 = !{}
!1036 = !DILocalVariable(name: "this", arg: 1, scope: !1034, file: !0, line: 0, type: !80)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!17, !115, !115, !17}
!1039 = distinct !DISubprogram(name: "Show", linkageName: "MessageBox__Show", scope: !90, file: !0, line: 700, type: !1037, scopeLine: 700, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !1040)
!1040 = !{}
!1041 = !DILocalVariable(name: "text", arg: 1, scope: !1039, file: !0, line: 699, type: !115)
!1042 = !DILocalVariable(name: "caption", arg: 2, scope: !1039, file: !0, line: 699, type: !115)
!1043 = !DILocalVariable(name: "style", arg: 3, scope: !1039, file: !0, line: 699, type: !17)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!89, !89}
!1046 = distinct !DISubprogram(name: "MessageBox__constructor", linkageName: "MessageBox__constructor", scope: !0, file: !0, line: 0, type: !1044, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !1047)
!1047 = !{}
!1048 = !DILocalVariable(name: "this", arg: 1, scope: !1046, file: !0, line: 0, type: !89)
!1049 = !DILocalVariable(name: "__temp705", scope: !1046, file: !0, line: 0, type: !89)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!19, !89}
!1052 = distinct !DISubprogram(name: "MessageBox__getClassName", linkageName: "MessageBox__getClassName", scope: !0, file: !0, line: 0, type: !1050, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !1053)
!1053 = !{}
!1054 = !DILocalVariable(name: "this", arg: 1, scope: !1052, file: !0, line: 0, type: !89)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!89, !89}
!1057 = distinct !DISubprogram(name: "MessageBox__finalize", linkageName: "MessageBox__finalize", scope: !0, file: !0, line: 0, type: !1055, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !1058)
!1058 = !{}
!1059 = !DILocalVariable(name: "this", arg: 1, scope: !1057, file: !0, line: 0, type: !89)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!89, !89}
!1062 = distinct !DISubprogram(name: "MessageBox__init", linkageName: "MessageBox__init", scope: !0, file: !0, line: 0, type: !1060, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !1063)
!1063 = !{}
!1064 = !DILocalVariable(name: "this", arg: 1, scope: !1062, file: !0, line: 0, type: !89)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!105}
!1067 = distinct !DISubprogram(name: "array_pWindow__new", linkageName: "array_pWindow__new", scope: !0, file: !0, line: 0, type: !1065, scopeLine: 0, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !1068)
!1068 = !{}
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!105, !105}
!1071 = distinct !DISubprogram(name: "constructor", linkageName: "array_pWindow__constructor", scope: !106, file: !1, line: 8, type: !1069, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !1072)
!1072 = !{}
!1073 = !DILocalVariable(name: "this", arg: 1, scope: !1071, file: !0, line: 7, type: !105)
!1074 = !DILocalVariable(name: "__temp10", scope: !1071, file: !0, line: 0, type: !209)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{null, !105}
!1077 = distinct !DISubprogram(name: "destructor", linkageName: "array_pWindow__destructor", scope: !106, file: !1, line: 18, type: !1075, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !1078)
!1078 = !{}
!1079 = !DILocalVariable(name: "this", arg: 1, scope: !1077, file: !0, line: 17, type: !105)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!17, !105}
!1082 = distinct !DISubprogram(name: "get_count", linkageName: "array_pWindow__get_count", scope: !106, file: !1, line: 23, type: !1080, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !1083)
!1083 = !{}
!1084 = !DILocalVariable(name: "this", arg: 1, scope: !1082, file: !0, line: 23, type: !105)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!17, !105}
!1087 = distinct !DISubprogram(name: "get_size", linkageName: "array_pWindow__get_size", scope: !106, file: !1, line: 25, type: !1085, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !1088)
!1088 = !{}
!1089 = !DILocalVariable(name: "this", arg: 1, scope: !1087, file: !0, line: 25, type: !105)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!98, !105, !17}
!1092 = distinct !DISubprogram(name: "get_item", linkageName: "array_pWindow__get_item", scope: !106, file: !1, line: 28, type: !1090, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !1093)
!1093 = !{}
!1094 = !DILocalVariable(name: "this", arg: 1, scope: !1092, file: !0, line: 27, type: !105)
!1095 = !DILocalVariable(name: "index", arg: 2, scope: !1092, file: !0, line: 27, type: !17)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{null, !105, !17, !98}
!1098 = distinct !DISubprogram(name: "set_item", linkageName: "array_pWindow__set_item", scope: !106, file: !1, line: 34, type: !1096, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !1099)
!1099 = !{}
!1100 = !DILocalVariable(name: "this", arg: 1, scope: !1098, file: !0, line: 33, type: !105)
!1101 = !DILocalVariable(name: "index", arg: 2, scope: !1098, file: !0, line: 33, type: !17)
!1102 = !DILocalVariable(name: "value", arg: 3, scope: !1098, file: !0, line: 33, type: !98)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!17, !105, !98}
!1105 = distinct !DISubprogram(name: "add", linkageName: "array_pWindow__add", scope: !106, file: !1, line: 40, type: !1103, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !1106)
!1106 = !{}
!1107 = !DILocalVariable(name: "this", arg: 1, scope: !1105, file: !0, line: 39, type: !105)
!1108 = !DILocalVariable(name: "value", arg: 2, scope: !1105, file: !0, line: 39, type: !98)
!1109 = !DILocalVariable(name: "newData", scope: !1105, file: !0, line: 44, type: !109)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{null, !105, !17, !98}
!1112 = distinct !DISubprogram(name: "insert", linkageName: "array_pWindow__insert", scope: !106, file: !1, line: 55, type: !1110, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !1113)
!1113 = !{}
!1114 = !DILocalVariable(name: "this", arg: 1, scope: !1112, file: !0, line: 54, type: !105)
!1115 = !DILocalVariable(name: "index", arg: 2, scope: !1112, file: !0, line: 54, type: !17)
!1116 = !DILocalVariable(name: "value", arg: 3, scope: !1112, file: !0, line: 54, type: !98)
!1117 = !DILocalVariable(name: "newData", scope: !1112, file: !0, line: 59, type: !109)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{null, !105, !17}
!1120 = distinct !DISubprogram(name: "removeAt", linkageName: "array_pWindow__removeAt", scope: !106, file: !1, line: 73, type: !1118, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !4, retainedNodes: !1121)
!1121 = !{}
!1122 = !DILocalVariable(name: "this", arg: 1, scope: !1120, file: !0, line: 72, type: !105)
!1123 = !DILocalVariable(name: "index", arg: 2, scope: !1120, file: !0, line: 72, type: !17)
